"""
На клавиатуре старых мобильных телефонов каждой цифре соответствовало несколько букв. Примерно так:

2:'abc',
3:'def',
4:'ghi',
5:'jkl',
6:'mno',
7:'pqrs',
8:'tuv',
9:'wxyz'

Вам известно в каком порядке были нажаты кнопки телефона, без учета повторов. Напечатайте все комбинации букв,
которые можно набрать такой последовательностью нажатий.

Формат ввода
На вход подается строка, состоящая из цифр 2-9 включительно. Длина строки не превосходит 10 символов.

Формат вывода
Выведите все возможные комбинации букв через пробел.
"""

n = [int(el) for el in input()]

combinations = {
    2: 'abc',
    3: 'def',
    4: 'ghi',
    5: 'jkl',
    6: 'mno',
    7: 'pqrs',
    8: 'tuv',
    9: 'wxyz'
}

prefix = ''


def rec_prefix(digit_list, prefix):
    if len(digit_list) == 0:
        print(prefix, end=' ')
    else:
        current_digit = digit_list[0]
        possible_letters = combinations[current_digit]
        for letter in possible_letters:
            rec_prefix(digit_list[1:], prefix + letter)


rec_prefix(n, prefix)
